[
    {
        "title": "Squier strat",
        "text": "This Squier bullet stratocaster is my first ever electric guitar and I bought it for 80 euros. It was a real beginner guitar but after a few months I already felt the need to give it some upgrades. Using my background in IT and some tools I had laying around I started by replacing the bridge pickup with a Kluson Texas Blues single coil. I picked this one ‘cause I love SRV and ZZ Top and the real Fender Texas Specials were too expensive to start with. The pickup came unshielded out of the box and it was unbearably noisy, so I decided to shield it myself with some extra wires and copper tape. I was surprised how well it worked and it made the guitar sound much better. In the neck position I added a Gibson mini humbucker I picked up in a guitar store, partly ‘cause I had never seen one in a strat and I wanted my only electric guitar to be as versatile as possible. The middle position I left empty since I didn’t use it at the time and I figured it would work as a type of killswitch which I loved. The neck I replaced with a maple fretboard neck I found in another guitar store for 90 euros to test out the differences between rosewood and maple fretboards. I also learned to set this guitar up to the best of my ability, which is something that I’m always improving. I never knew how many tiny differences change the way a guitar plays and sounds. Even though it turned into a real frankenstrat this guitar will always hold a special place in my heart since it was a major improvement from the initial Squier and because it sparked my love for working on guitars.",
        "image_url1": "../images/squier.jpg",
        "type": "axe",
        "index": 0
    },
    {
        "title": "My signature stratoscaster",
        "text": "This is my first attempt at making a guitar from scratch and it still is my favorite project. I wanted something that would give me room to be creative but also result in a good real stratocaster. Using what I learned from my souped-up Squier, I wanted to create what I consider my personal signature model. The neck is a real Fender maple strat neck with a C profile and the big headstock which I love. The body is a vintage white colored strat body from a British guitar store and the neck/middle pickups are Fender Texas Specials to emulate the sound of one of my guitar heroes, Stevie Ray Vaughan. I also put in a lefty bridge like as a little nod to SRV and Jimi Hendrix, but also to make the guitar a little more unique. Lefty headstocks I find a little overdone but a left-handed bridge you almost never see. To add to the uniqueness I also added a Gibson ’59 PAF humbucker in the bridge, cause I wanted the guitar to be as versatile as the music I play. For the electronics I wanted to keep it as old school as possible so I put in 500k pots and a paper-in-oil capacitor and finished the guitar off with the most psychedelic pickguard I could find.",
        "image_url1": "../images/signature-strat.jpg",
        "type": "axe",
        "index": 1
    },
    {
        "title": "Gibson Les Paul",
        "text": "This is my Gibson 60’s tribute Les Paul from 2011. When I bought it, it was already in good shape but it needed a little bit of work on the frets and the electronics. From what I could see it looked as thought the frets might have been replaced at some point and the edged were sharp on some of the frets. I fixed the fret edges and polished the frets until it sounded as new again and I changed the nut and put in a bone nut to add to the vintage vibe of the guitar. The bridge pickup signal would occasionally get disrupted when adjusting the volume so I replaced some of the wires to fix that. I also adjusted the setup so it plays the way I like my guitars to play.",
        "image_url1": "../images/gibson.jpg",
        "type": "axe",
        "index": 2
    },
    {
        "title": "Japanese vintage - Morris Les Paul",
        "text": "This Japanese Les Paul is my most recent project. From what I can tell it’s most likely from the 70s or 80s and it was in rough shape when I found it. Based on the open-book headstock and pearl inlays I would assume it’s a pre lawsuit era guitar but it needed a lot of work to make it playable again. I started by filing and polishing all the frets since some of them were uneven or completely sharp on the edges. The binding was starting to fall off of the neck so I made sure this was re-applied as well. \\n\\n The ground wire from the bridge was broken so I made sure to ground the guitar again and used copper tape inside the body. This Les Paul is extremely light because it’s almost completely hollow so I made sure to ground the cavity properly to avoid unwanted noise. \\n\\n The original Maxon pickup was completely disassembled but still functional after I managed to put it back together, and for fun I added another humbucker in the middle ‘cause I love the look and sound of an HHH Les Paul. I added a push-pull pot to make use of the pickup’s coil splitting and wired the electronics using a 50s style schematic because I love the differences in tone when rolling the volume down.",
        "image_url1": "../images/morris.jpg",
        "image_url2": "../images/morris-PJ.jpg",
        "type": "axe",
        "index": 3
    },
    {
        "title": "Japanese vintage - Maya stratocaster",
        "text": "This guitar right here is my first attempt at restoring a vintage Japanese guitar. Don’t let the headstock fool you, it’s a Japanese Maya stratocaster from the 70’s and it was in poor health when I bought it for 60 euros. I started out by replacing some of the electronics inside, including replacing the original 3-way switch for a 5-way. The middle pickup was broken so I opened it up and re-soldered the copper wire to the solder connection as carefully as possible. The neck was in especially rough shape, so I started by fixing the truss rod and replacing the nut with a new bone nut since I love the vintage tone that these give. I did everything I could to save the original frets and after very careful sanding and polishing they sound as good as they can. I also replaced the tuners and I decided to strip some of the coating and replace the decal with a Fender one out of personal preference. I re-finished the headstock and oiled the fretboard and I’ve been loving this guitar ever since. From what I can tell it probably was never a very high quality guitar, but due to decades of aging it feels and sounds vintage in a way that the first strat I built can only try to emulate. The pickups sound incredible and the fretboard feels smoother than my maple neck, I even love the light buzzing of the strings against the tiny worn down frets.",
        "image_url1": "../images/maya.jpg",
        "type": "axe",
        "index": 4
    },
    {
        "title": "Windesheim schedule app",
        "text": "I got my Bachelors degree in software engineering/IT at Windesheim university of applied sciences in Zwolle, Overijssel. Like every other student I used the official Windesheim app to keep track of my classes but this app left a lot to be desired. I found the UI/UX to be poorly made and moreover the app would frequently crash or cause my phone to overheat. As soon as I found out Windesheim had a public API for retrieving schedule data I decided to make my own schedule app. \\n\\n At the time I had experience with React-native but I was researching alternatives such as Flutter. I ended up choosing Flutter to make this app so I could really compare the two frameworks side by side. What I loved about Flutter was how uniformly everything worked and looked across all platforms. React-native tends to adopt more of the native platform behaviors which is not always ideal. Even though Flutter is a relatively new framework there are great packages for anything you could need and I made use of that for my app. I was very happy with the end result and I distributed the app among my friends and classmates.\\n\\n I never uploaded it to the Play store or App store because I didn’t want to spend the store fees as a broke college student but I used it throughout my college years. I learned a lot making this app and I’ve been using and loving Flutter ever since.",
        "image_url1": "../images/schedule-vid.gif",
        "type": "app",
        "index": 5
    },
    {
        "title": "Cryptocurrency portfolio app - Gripto",
        "text": "In 2018 during my final year of my vocational education ‘Application Development’, I interned at Moor Interactive in Zwolle, Overijssel. The price of Bitcoin skyrocketed during this time and cryptocurrencies became very popular. This led to Moor Interactive working on a beginner friendly crypto portfolio app/website called ‘Gripto’. Gripto was my main project for this internship.\\n\\n By this time I had some experience making apps in the C# Xamarin framework, but for this project I learned to use React, React-native, Redux and Django. At first it was challenging to learn these new frameworks and programming languages, but luckily I worked in a small team and I picked it up fast. As an intern it was my job to do a little of everything: front-end, back-end, database management and designing some small custom components within the app. I learned a lot during this time and I not only grew as a programmer, but I became fluent with frameworks and languages that I used throughout the years after.\\n\\n Unfortunately I’m not sure what happened with Gripto since my internship ended but as far as I know it was never released. I would’ve really loved to see Gripto get published but nevertheless I’m happy with my contribution to the project and what I learned while working on it.\\n\\n",
        "image_url1": "../images/gripto2.jpg",
        "image_url2": "../images/gripto3.jpg",
        "image_url3": "../images/gripto-dashboard.jpg",
        "type": "app",
        "index": 6
    },
    {
        "title": "Wagtail CMS - Portfolio website",
        "text": "In 2018 I worked as an intern at Moor Interactive in Zwolle, Overijssel. I worked on multiple projects, mostly using React(-native) and Python’s Django framework. After getting acquainted with Django I decided to dive into Wagtail and use it to make a new resume website. Wagtail is a Django CMS similar to Wordpress except it requires more coding, which I liked because it meant I could learn more about Django. Before starting this internship my experience with web development was limited to PHP, which I was never a big fan of.\\n\\n That same year in Arnhem, me and my boss attended Wagtail Space, a global conference regarding all things Wagtail. People come together to work on new features for Wagtail and watch presentations by various speakers about different aspects of Wagtail and other relevant topics. Before the end of my internship I had made a decent resume site by using what I learned. At first I hosted it in AWS because I wanted to try using the platform, but later I opted to host the static website on Github Pages since it’s much easier and free to use. The website can be found <a href='/wagtailsite/index.html'>here</a>.",
        "image_url1": "../images/oldsite.jpg",
        "image_url2": "../images/wagtailspace.jpg",
        "type": "app",
        "index": 7
    },
    {
        "title": "My first app",
        "text": "In 2016 while completing my intermediate vocational education at Landstede, Raalte I worked as an intern at Eazis music & systems in Almelo. Eazis is a company that makes music computers and software for bars, restaurants, clubs etc. and I worked on a bit of everything. Some of my tasks included: \\n\\n - Learning to use Photoshop to create custom images for the music software;\\n - Updating the music libraries;\\n - Going along with computer repair technicians to clients experiencing issues;\\n - Learning about app development by making my first app.\\n\\n My main job was to help develop their new Jukebox app that worked in tandem with their main music software, which was challenging since I had no prior experience with mobile apps. To help me get acquainted with app development I created a basic quiz game together with my boss. I combined my love and knowledge of old music with app development and the final result was a game where you guess what song/artist/album is presented. Originally it was made for iOS in Objective C but later when I started working with C# I remade it using Xamarin. Unfortunately the debug build of the app stopped working after a while but above you can see what it used to look like. The background I created in Photoshop.",
        "image_url1": "../images/first-app.jpg",
        "type": "app",
        "index": 8
    },
    {
        "title": "Forumland website",
        "text": "A few years ago I was asked by a friend to help create a proof-of-concept website for ‘Forumland’, an idea by the political party Forum voor democratie. A teacher at Saxion university of applied sciences who’s acquainted with the party leader asked us to make it in a week and this is what we came up with. Regardless of my own political views I thought it was an exciting project to be part of and I enjoyed working on it. \\n\\n The site was made using React since this was what I was learning at the time and it helped us quickly create a functional proof-of-concept site. As far as I’m aware, FVD did not pursue the idea for Forumland so the site never went live, but I’m happy I got the opportunity to work on something for a big client.",
        "image_url1": "../images/fvd.jpg",
        "image_url2": "../images/fvd-vid.gif",
        "type": "app",
        "index": 9
    },
    {
        "title": "Bandmate app",
        "text": "When I was in college I had the idea to make an app to bring musicians together. As a musician who’s always looking for people to jam with or start a band together I found there wasn’t really a good way to find other likeminded people. My idea was simple: Tinder for musicians. Bandmate was a passion project of mine for a while and I enjoyed creating this idea from the ground up myself. Unfortunately while I was working on Bandmate, an app with the same idea called Vampr was released. At the time I was just a young college student working on a cool idea but I didn’t have the resources or the team to really help make this app ready for publishing. \\n\\n I made the database, API and all the functionality in Python with Django. I just finished an internship where I learned to use Django and I wanted to continue learning to use it and working on Bandmate kept me learning and growing. I also used React-native for the app but later switched to Flutter because I was interested in the differences between the two similar frameworks. I worked on this project alone so all the designing, front-end and back-end was done by me. While working on this app I learned I prefer front-end development over back-end and what I love most is turning a cool concept into reality.",
        "image_url1": "../images/bandmate-2.jpg",
        "image_url2": "../images/bandmate-vid.gif",
        "type": "app",
        "index": 10
    },
    {
        "title": "e-UUR app",
        "text": "In 2020 while I was a freshman in college studying software engineering, I started working for Akyla in Enschede. Akyla made software for temp agencies and their clients and they were in need of a new mobile app. The company’s main focus was on maintainting their web app, called e-UUR, and I was hired as the new (and only) app developer. It was my task to make a new app from scratch, which is no small project for a 21 year old student.\\n\\n Akyla had many clients, all with their own version of the e-UUR dashboard and app. The e-UUR app uses the web dashboard in a webview, and this was the case for 20+ clients and their respective apps. This made it so there were individual projects for each Android and iOS app, all containing nearly identical code. The apps were also native, making it more difficult to maintain the apps and add new features or bug fixes. Understandably they wanted to change this way of app development and this was my idea as to how.\\n\\n I had some experience with React-native by this point and I was also looking into the Flutter framework. Firstly I wrote a research paper on the two frameworks and how they compare/differ. My conclusion was that Flutter might be a better fit for the new e-UUR app and the company gave the green light to implement it. Using Flutter instead of a native iOS and Android app had the following benefits:\\n\\n - One programming language to use as opposed to two;\\n - Updates, new features and bug fixes are done once and automatically translated to native code;\\n - Growing community with many packages to implement;\\n - Uniform predictable behavior across both platforms;\\n - Option to easily expand to web, Windows, MacOS and Linux platforms.\\n\\n The problem of separate app projects for each client I solved through using ‘app flavors’. Flavors are a way of installing different versions of the same app with minimal changes. This was perfect of course since the only changes between the client apps were the name, app icon, UI colors and dashboard URL. In the end the combination of Flutter and app flavors removed the need for around 40 apps and sped up development time greatly, which I’m very proud of.",
        "image_url1": "../images/euur-vid.gif",
        "type": "app",
        "index": 11
    },
    {
        "title": "Vintage Pearl Les Paul",
        "text": "This Les Paul is the newest addition to my collection of vintage axes: a Pearl Les Paul, made in Japan in the early 70s. With a completely solid body, a glued-on neck and 450k pots it’s the most high quality Japanese guitar I’ve ever found. From what I can tell it’s all original, including the frets and Maxon humbuckers and it sounds unbelievable.\\n\\n The only work I had to do on this Pearl Les Paul was the setup, since I don’t know when it’s been set up last and I like my guitars to have light gauge strings and low action. I started by adjusting the truss rod to fix some back bow and then I properly set the nut height. The bridge was not in great condition so I switched it out for a Gibson tune-o-matic. This beautiful Les Paul was already in great condition and needed very little work, but now it’s perfect for my style of playing.",
        "image_url1": "../images/pearl.jpg",
        "type": "axe",
        "index": 12
    },
    {
        "title": "Tripbuddy",
        "text": "In my 3rd year of college I took part in an entrepreneurship specialization. For this semester me and a small group of non-programmers worked on creating an app for solo travelers looking to connect. At the time I was traveling a lot and through meeting people and my own experiences I came up with this idea as a kind of replacement for couchsurfing. This was a great project to work on since I myself am the target audience for the app, which meant I had plenty of ideas to bring to the table. Since this wasn’t strictly an IT semester I worked with a lot of people who weren’t familiar with mobile app development. This meant I would be the only one programming which came with its challenges.\\n\\n Before working on the app I made some mockup designs in Sketch and once they were approved by the team I started creating the app. The app was made for iOS, Android and the basic functionality worked on web as well. Of course I opted to use Flutter for this project, especially since I would be making it alone and needed to save as much time as possible. I used Google’s APIs to handle authentication, location services and database management because it works so seamlessly with Flutter.\\n\\n Towards the end of the semester the plan was to release a beta version to a small number of people, but unfortunately this didn’t come to fruition. The concept of the app relies too much on a large active user base and the app wasn’t polished enough to attract the necessary users. For that reason we decided to not release it at the time, but I’m still very proud of the end result and the progress I made in just a few months.",
        "image_url1": "../images/tripbuddy.jpeg",
        "image_url2": "../images/tripbuddy-gif.gif",
        "type": "app",
        "index": 13
    },
    {
        "title": "Waves",
        "text": "Back in 2020 I got really into surfing and started going to the beach a lot. Since the Netherlands isn’t exactly known for having good waves I relied a lot on the Surfline app to figure out when surf conditions were right. Around this time I was already busy making apps so I figured this would be a good opportunity to make my own version for both mobile and web.\\n\\n The Surfline app is great and I didn’t have trouble using it, but I thought I’d be able to make a more tailored app for myself to use. Since I was just a beginner I didn’t need all the data Surfline offered and I wanted to make something more lightweight and simple. Using Flutter and a free weather API I found online I made this app in just a few weeks and started using it whenever I wanted to go out surfing. It was through little projects like this that I really started to get into making apps and finding ways I could use them in my every day life.",
        "image_url1": "../images/waves.jpeg",
        "image_url2": "../images/waves-gif.gif",
        "image_url3": "../images/waves-web.gif",
        "type": "app",
        "index": 14
    }
]